notes/notes.org
#+OPTIONS: toc:nil
#+LATEX_CLASS_OPTIONS: [12pt]
#+LATEX_HEADER: \usepackage[margin=1.0in]{geometry}
#+LATEX_HEADER: \documentclass{article}
#+LATEX_HEADER: \usepackage{setspace,mathrsfs,amsmath,amsthm,amssymb,graphicx,cancel,lmodern,mathtools}

#+NAME: newcommand
#+BEGIN_EXPORT latex
\newcommand\abs[1]{\left|#1\right|}
\newcommand\deg{\textdegree}
\newcommand\Real{\mathbb{R}}
\newcommand\Natural{\mathbb{N}}
\newcommand\sube{\subseteq}
\newcommand\supe{\supseteq}
\newcommand\sub{\subset}
\newcommand\sup{\supset}
\newcommand\setm{\setminus}
\newcommand\pr{\ensuremath{'}}
\newcommand\R{\mathcal{R}}
\newcommand\calR{\mathcal{R}}
\newcommand\calP{\mathcal{P}}
\newcommand\pow{\mathscr{P}}
\newcommand\indX{\mathscr{X}}
\newcommand\nil{\varnothing}
#+END_EXPORT

#+NAME: newtheorem
#+BEGIN_EXPORT latex
\newtheorem{lemma}[Theorem]{lemma}
\theoremstyle{definition}
\newtheorem{definition}{Def}[section]
#+END_EXPORT

* Chapter One
** Automaton
   #+NAME: Finite Automaton
   #+BEGIN_EXPORT latex
   \begin{definition}[Finite Automaton]
     A \textit{\textbf{finite automaton}} is a 5-tuple $(Q,\Sigma,\delta,q_0,F)$,
     where:
     \begin{enumerate}
     \item $Q$ is a finite set called the \textit{\textbf{states}},
     \item $\Sigma$ is a finite set called the \textit{\textbf{alphabet}},
     \item $\delta$: $Q\times\Sigma\longrightarrow Q$ is the
       $\textit{\textbf{transition function}}$,
     \item $q_0\in Q$ is the \textit{\textbf{start state}}, and
     \item $F\subseteq Q$ is the \textit{\textbf{set of accept states}}.
     \end{enumerate}
   \end{definition}
   #+END_EXPORT

   #+NAME: Nondeterministic Finite Automaton
   #+BEGIN_EXPORT latex
   \begin{definition}[Nondeterministic Finite Automaton]
     A \textit{\textbf{nondeterministic finite automaton}} is a 5-tuple
     $(Q,\Sigma,\delta,q_0,F)$, where:
     \begin{enumerate}
     \item $Q$ is a finite set called the \textit{\textbf{states}},
     \item $\Sigma$ is a finite set called the \textit{\textbf{alphabet}},
     \item $\delta$: $Q\times\Sigma\longrightarrow \pow(Q)$ is the
       $\textit{\textbf{transition function}}$,
     \item $q_0\in Q$ is the \textit{\textbf{start state}}, and
     \item $F\subseteq Q$ is the \textit{\textbf{set of accept states}}.
     \end{enumerate}
   \end{definition}
   #+END_EXPORT

   #+NAME: Generalized Nondeterministic Finite Automaton
   #+BEGIN_EXPORT latex
   \begin{definition}[Generalized Nondeterministic Finite Automaton]
     A \textit{\textbf{generalized nondeterministic finite automaton}} is a
     5-tuple $(Q,\Sigma,\delta,q_0,F)$, where:
     \begin{enumerate}
     \item $Q$ is a finite set called the \textit{\textbf{states}},
     \item $\Sigma$ is the \textit{\textbf{input alphabet}},
     \item $\delta : (Q-\{q_{accept}\}) \times (Q-\{q_{start}\}) \longrightarrow
       \R$ is the $\textit{\textbf{transition function}}$,
     \item $q_{start}$ is the \textit{\textbf{start state}}, and
     \item $q_{accept}$ is the \textit{\textbf{accept state}}.
     \end{enumerate}
     The symbol $\R$ is the collection of all regular expressions over the
     alphabet $\Sigma$, and $q_{start}$ and $q_{accept}$ are the start and
     accept states. If $\delta(q_i,q_j)=R$, the arrow from state $q_i$ to state
     $q_j$ has the regular expression $R$ as its label. The domain of the
     transitition function is $(Q-\{q_{accept}\})\times(Q-\{q_{start}\})$
     because an arrow connects every state to every other state, except that no
     arrows are coming from $q_{accept}$ or going to $q_{start}$.
   \end{definition}
   #+END_EXPORT

** Computation
   #+NAME: Computation
   #+BEGIN_EXPORT latex
   \begin{definition}[Computation]
     Let $M=(Q,\Sigma,\delta,q_0,F)$ be a finite automaton and let $w=w_1w_2\dots
     w_n$ be a string where each $w_i$ is a member of the alphabet $\Sigma$. Then
     $M$ accepts $w$ if a sequence of states $r_0,r_1,\dots,r_n\in Q$ exists with
     three conditions:
     \begin{enumerate}
     \item $r_{0}=q_{0}$,
     \item $\delta(r_i,w_{i+1})=r_{i+1}$, for $i=0,\dots,n-1$, and
     \item $r_n\in F$.
     \end{enumerate}
   \end{definition}
   #+END_EXPORT

   #+NAME: Recognizes
   #+BEGIN_EXPORT latex
   \begin{definition}[recognizes]
     $M$ \textit{\textbf{recognizes language}} $A$ if $A=\{w : M \text{ accepts }
     w\}$.
   \end{definition}
   #+END_EXPORT

** Regular
   #+NAME: Regular
   #+BEGIN_EXPORT latex
   \begin{definition}[Regular]
     A language is called a \textit{\textbf{regular language}} if some finite
     automaton recognizes it.
   \end{definition}
   #+END_EXPORT

   #+NAME: Regular Operations
   #+BEGIN_EXPORT latex
   \begin{definition}[Regular Operations]
     Let $A$ and $B$ be languages. We define the regular operations
     \textit{\textbf{union}}, \textit{\textbf{concatenation}} and
     \textit{\textbf{star}} as follows:
     \begin{itemize}
       \item \textbf{Union}: $A \cup B=\{x : x\in A \text{ or } x\in B\}$.
       \item \textbf{Concatenation}: $A \circ B=\{xy : x\in A \text{ and } y\in
       B\}$.
       \item \textbf{Star}: $A^*=\{x_1x_2\dots x_k : k\ge0 \text{ and each }
       x_i\in A\}$
     \end{itemize}
     In arithmetic, we say that $\times$ has precedence over over + to mean that
     when there is a choice, we do the $\times$ operation first. Thus in
     $2+3\times4$, the $3\times4$ is done before the addition. To have the
     addition done first, we must add paretheses to to obtain $(2+3)\times4$. In
     regular expressions, the star operation is done first, followed by
     concatenation, and finally union, unless parentheses change the usual
     order.
   \end{definition}
   #+END_EXPORT

   #+NAME: Regular Expression
   #+BEGIN_EXPORT latex
   \begin{definition}[Regular Operations]
     Say that $R$ is a {\textit{\textbfregular expression}} if $R$ is:
     \begin{enumerate}
       \item $a$ for some $A$ in the alphabet $\Sigma$,
       \item $\varepsilon$,
       \item $\varnothing$,
       \item $(R_1 \cup R_2)$, where $R_1$ and $R_2$ are regular expressions,
       \item $(R_1 \circ R_2)$, where $R_1$ and $R_2$ are regular expressions, or
       \item $(R_1^*)$, where $R_1$ is a regular expression.
     \end{enumerate}
     In items 1 and 2, the regular expressions $A$ and $\varepsilon$ represent the
     languages $\{a\}$ and $\{\varepsilon\}$, respectively. In item 3, the regular
     expression $\varnothing$ represents the empty language. In items 4, 5, and 6,
     the expressions represent the languages obtained by taking the union or
     concatenation of the languages $R_1$ and $R_2$, or the star of the language
     $R_1$, respectively.
   \end{definition}
   #+END_EXPORT

   #+NAME: Equivalence With Finite Automata
   #+BEGIN_EXPORT latex
   \begin{definition}[Equivalence With Finite Automata]
     \label{Equivalence With Finite Automata}
     A language is \textit{\textbf{regular}} if and only if some regular expression
     describes it.
   \end{definition}

   \begin{definition}{Equivalence With Regular Expressions}
     \textbf{Def \ref{Equivalence With Finite Automata}} means as well that if
     a language is described by a $\textit{\textbf{regular expression}}$, then
     it is $\textit{\textbf{regular}}$.
   \end{definition}
   #+END_EXPORT

** Nonregular Languages
   #+NAME: Pumping Lemma
   #+BEGIN_EXPORT latex
   \begin{definition}[Puming Lemma]
     If $A$  is a  regular language,  then there  is a  number $p$  (the pumping
     length) where if  s is any string in  $A$ of length at least  $p$, then $s$
     may  be  divided  into  three pieces,  $s=xyz$,  satisfying  the  following
     conditions:
     \begin{enumerate}
       \item for each $i \ge 0$, $xy^iz \in A$,
       \item $\abs{y} > 0$, and 
       \item $\abs{xy} \le p$.
     \end{enumerate}
   \end{definition}
   #+END_EXPORT

* Chapter Two
