notes/notes.org
** Context-Free Grammar
 #+NAME: Context-Free Grammar
 #+BEGIN_EXPORT latex
 \begin{definition}[Context-Free Grammar]
   A \textit{\textbf{context-free grammar}} is a 4-tuple $(V,\Sigma,R,S)$,
   where :---
   \begin{enumerate}
   \item $V$ is a finite set called the \textit{\textbf{variable}},
   \item $\Sigma$ is a finite set, disjoint from $V$, called the
     \textit{\textbf{terminals}},
   \item $R$ is a finite set of \textit{\textbf{rules}}, with each rule being a
     variable and a string of variables and terminals, and
   \item $S \in V$ is the start variable.
   \end{enumerate}
   The \textit{\textbf{language of the grammar}} is $\{w\in\Sigma^* : S
   \xRightarrow[]{\text{*}} w\}$. That is, say that $u$
   \textit{\textbf{derives}} $v$, written $u \xRightarrow[]{\text{*}} v$, if
   $u=v$ or if a sequence $u_1,u_2,\dots,u_k$ exists for $k\ge0$ and
   $$u\Rightarrow u_1 \Rightarrow u_2 \Rightarrow \dots \Rightarrow u_k
   \Rightarrow v.$$
 \end{definition}
 #+END_EXPORT

 #+NAME: Chomsky Normal Form
 #+BEGIN_EXPORT latex
   \begin{definition}[Chomsky Normal Form]
     A context-free grammar is in Chomsky normal form if every rule is of the
     form :---
     \begin{center}
       \begin{tabular}{l}
         $A \rightarrow BC$ \\
         $A \rightarrow a$ \\
       \end{tabular}
     \end{center}
     where $a$ is any terminal and $A$, $B$, and $C$ are any variable---except
     that $B$ and $C$ may not be the start variable. In addition, we permit the
     Rule $S \rightarrow \varepsilon$, where $S$ is the start variable.
   \end{definition}
   #+END_EXPORT

** Pushdown Automata
   #+NAME: Pushdown Automaton
   #+BEGIN_EXPORT latex
   \begin{definition}[Pushdown Automaton]
     A \textit{\textbf{pusdown automaton}} is a 6-tuple
     $(Q,\Sigma,\Gamma,\delta,q_0,F)$, where $Q$, $\Sigma$, $\Gamma$, and $F$
     are all finite sets, and :---
     \begin{enumerate}
     \item $Q$ is the set of states,
     \item $\Sigma$ is the input alphabet,
     \item $\Gamma$ is the stack alphabet,
     \item $\delta : Q\times\Sigma_\varepsilon\times\Gamma_\varepsilon
       \longrightarrow \calP(Q\times\Gamma_\varepsilon)$ is the transition function,
     \item $q_0 \in Q$ is the start state, and
     \item $F \sube Q$ is the set of accept states.
     \end{enumerate}
     Recall that $\Sigma_\varepsilon=\Sigma\cup\{\varepsilon\}$ and
     $\Gamma_\varepsilon=\Gamma\cup\{\varepsilon\}$. The domain of the transition
     function is $Q\times\Sigma_\varepsilon\times\Gamma_\varepsilon$. Thus the
     current state, next input symbol read, and top symbol of the stack determine
     the next move of a pushdown automaton.
   \end{definition}
   #+END_EXPORT

   #+NAME: Equivalence With Context-Free Grammar
   #+BEGIN_EXPORT latex
   \begin{definition}[Equivalence With Context-Free Grammar]
     A language is context free if and only if some pushdown automaton recognizes
     it. If a language is context free, then some pushdown automaton recognizes
     it.
   \end{definition}
   #+END_EXPORT

* Chapter Three
** Turing Machine
   #+NAME: Turing Machine
   #+BEGIN_EXPORT latex
   \begin{definition}[Turing Machine]
     A  \textit{\textbf{Turing  machine}}  is  a  7-tuple  $(Q,  \Sigma,  \Gamma,  \delta,  q_0,
     q_{accepts}, q_{reject})$, where $Q, \Sigma, \Gamma$ are all finite sets and
     \begin{enumerate}
     \item $Q$ is the set of states,
     \item $\Sigma$ is the input alphabet not containing the blank symbol $\_$,
     \item $\Gamma$ is the tap alphabet, where $\_ \in \Gamma$ and $\Sigma \sube \Gamma$,
     \item $\delta : Q \times \Gamma \longrightarrow Q \times  \Gamma \times \{ $L$, $R$ \}$ is the transition
       function,
     \item $q_0 \in Q$ is the start state,
     \item $q_{accept} \in Q$ is the accept state, and
     \item $q_{reject} \in Q$ is the reject state, where $q_{reject} \ne q_{accept}$.
     \end{enumerate}
   \end{definition}
   #+END_EXPORT

   #+NAME: Other Turing Machines
   #+BEGIN_EXPORT latex
   \begin{definition}[Multitape Turing Machine]
     The  only difference  is that  $$\delta :  Q  \times \Gamma^k  \longrightarrow Q  \times \Gamma^k  \times
     \{\text{L}, \text{R}, \text{S}\}^k,$$ where $k$ is the number of tapes. The
     expression  $$\delta(q_i,  a_1  ...,  a_k)  = (q_j,  b_1,  ...,  b_k,  \text{L},
     \text{R}, ..., \text{L})$$ means that if  the machine is in state $q_i$ and
     heads $1$ through $k$ are reading  symbols $a_1$ through $a_k$, the machine
     goes to state  $q_j$, writes symbols $b_1$ through $b_k$,  and directs each
     head to mave left or right, or to stay put, as specified.
   \end{definition}


   \begin{definition}[Nondeterministic Turing Machine]
     The  only difference  is that  $$\delta :  Q \times  \Gamma \longrightarrow  \pow(Q \times  \Gamma \times
     \{\text{L},  \text{R}\}).$$  All  of  the  nondeterministic  paths  can  be
     simulated on a multitape Turing Machine.
   \end{definition}
   #+END_EXPORT

   #+NAME: Terminology
   - /*start configuration*/
   - /*accepting configuration*/
   - /*rejecting configuration*/
   - /*halting configuration*/

   #+NAME: Decidability
   - Call a language /*Turing-recognizable*/ if some Turing machine recognizes
     it. (/*recursively enumerable language*/)
     - A language is Turing-recognizable $\iff$ some enumerator enumerates it.

   - Call a language /*Turing-decidable*/ or simply decidable if some Turing
     machine decides it. (/*recursive language*/)
     - A language is decidable $\iff$ some nondeterministic Turing machine
       decides it.

* Chapter Four
