notes/notes.org
** Decidable 
 - $A_{DFA}=\{\langle B,w \rangle : B \text{ is a DFA that accepts input string }
   w\}$ is a _decidable language_.
   - $M=$ "On input $\lang B,w \rang$:
     1) Simulate $B$ on input $w$.
     2) If the simulation ends in an accept state, /accept/. If it ends in a
        nonaccepting state, /reject/"

 - $A_{NFA}=\{\langle{}B,w\rangle : B \text{ is an NFA that accepts input
   string } w\}$ is a _decidable language_.
   - $N=$ "On input $\langle B,w \rangle$:
     1) Convert NFA $B$ to an equivalent DFA $C$, using the procedure for this
        conversion given in Theorem 1.39.
     2) Run TM $M$ from Theorem 4.1 on input $\langle C,w \rangle$.
     3) If $M$ accepts, /accept/; otherwise, /reject/."

 - $A_{REX}=\{\langle{}R,w\rangle : R \text{ is a regular expression that
   generates string } w\}$ is a _decidable language_.
   - $P=$ "On input $\langle R,w \rangle$:
     1) Convert regular expression $R$ to an equivalent NFA $A$ be using the
        procedure for this conversion given in Theorem 1.54.
     2) Run TM $N$ on input $\langle{}A,w\rangle$.
     3) If $N$ accepts, /accept/; if $N$ rejects, /reject/."

 - $E_{DFA}=\{\langle A\rangle : A \text{ is a DFA and } L(A)=\varnothing\}$
   is a _decidable language_.
   - $T=$ "On input $\langle A \rangle$:
     1) Mark the start state of $A$.
     2) Repeat until no new states get marked:
        1) Mark any state that has a transition coming into it from any state that
         is already marked.
     3) If no accept state is marked, /accept/; otherwise, /reject/."

 - $EQ_{DFA}=\{\langle A,B \rangle : A \text{ and } B \text{ are DFAs and }
   L(A)=L(B)\}$ is a _decidable language_.
   - This new DFA $C$ accepts only those strings that are accepted by either $A$
     or $B$ but not by both. Thus, if $A$ and $B$ recognize the same language,
     $C$ will accept nothing.
     $$L(C)=\left(L(A) \cap \overline{L(B)}\right) \cup
     \left(\overline{L(A)} \cap L(B)\right)$$
   - $F=$ "On input $\langle{}A,B\rangle$:
     1) Construct DFA $C$ as described.
     2) Run TM $T$ from Theorem 4.4 on input $\langle{}C\rangle$.
     3) If $T$ accepts, /accept/. If $T$ rejects, /reject/."

 - $A_{CFG}=\{\langle{}G,w\rangle : G \text{ is a CFG that generates string }
   w\}$ is a _decidable language_.

 - $E_{CFG}=\{\langle{}G\rangle : G \text{ is a CFG and } L(G)=\varnothing\}$
   is a _decidable language_.

** Undecidable
 - $A_{TM}=\{\langle{}M,w\rangle : M \text{ is a TM and } M \text{ accepts }
   w\}$ is an _undecidable language_. It is also _Turing-recognizable_. recognizers
   /are/ more powerful than deciders. $U$ recognizes $A_{TM}$, it is the universal
   Turing machine capable of simulating every other Turing machine. 
   - $U=$ "On input $\langle{}M,w\rangle$:
     1) Simulate $M$ on input $w$.
     2) If $M$ ever enters its accept state, /accept/; if $M$ ever enters its
        reject state, /rejects/."
   - The proof of this relies on a technique called /diagonalization/.

 - $HALT_{TM}=\{\langle M,w \rangle : M \text{ is a TM and } M \text{ accepts } w\}$ is an
   _undecidable language_. It is also _Turing-recognizable_. Let's assume for
   the purpose of obtaining a contradiction that TM $R$ decides /HALT/_{TM}
   - $U=$ "On input $\langle M, w \rangle$, an encoding of a TM $M$ and
     a string $w$:
     1) Run TM $R$ on input $\langle M,w \rangle$.
     2) If $R$ rejects, /reject/.
     3) If $R$ accepts, simulate $M$ on $w$ until it halts.
     4) If $M$ has accepted, /accept/; if $M$ has rejected, /reject/."
   - Clearly, if $R$ decides HALT_{TM}, then $S$ decides A_{TM}. Because A_{TM}.
     Because A_{TM} is undecidable, HALT_{TM} also must be undecidable.

* Chapter Five
** Reducible
 #+NAME: Computation History
 #+BEGIN_EXPORT latex
 \begin{definition}[Computation History]
   Let $M$  be a Turing  Machine and $w$  an input string.  An \textbf{accepting
     computation history} for $M$ on $w$  is a sequence of configurations, $C_1,
     C_2, ..., C_l$, where $C_1$ is the start configuration of $M$ on $w$, $C_l$
     is  an  accepting configuration  of  $M$  on  $w$,  $C_l$ is  an  accepting
     configuration  of $M$,  and  each $C_i$  legally follows  from  $C_{i -  1}
     $according to  the rules of  $M$. A \textbf{rejecting  computation history}
     for  $M$ on  $w$ is  defined similarly,  except that  $C_l$ is  a rejecting
     configuration.

 \end{definition}
 #+END_EXPORT

 #+NAME: Linear Bounded Automaton
 #+BEGIN_EXPORT latex
 \begin{definition}[Linear Bounded Automaton]
   A \textbf{linear  bounded automaton}  is a restricted  type of  Turing machine
   wherein the  tape head  isn't permitted to  move off the  portion of  the tape
   containing the input. If the machine tries  to move its head off either end of
   the input, the head stays where it is---in the same way that the head will not
   move off the left-hand end of an ordinary Turing machine's tape.
 \end{definition}

 \begin{lemma}
   Let $M$ be an LBA with $q$ states  and $g$ symbols in the tape alphabet. There
   are exactly $qng^n$  distinct configurations of $M$ for a  tape of length $n$.
   \end{lemma} 
 #+END_EXPORT

 - $A_{LBA}$ is  _decidable_. $E_{LBA}$ is  _undecidable_. $E_{LBA} = \{  \langle M
   \rangle \mid M$ is an LBA and $L(M) = \varnothing \}$

 - ALL_{CFG} is _undecidable_. $ALL_{CFG} = \{ \langle G \rangle \mid G$ is a CFG
   and $L(G) = \Sigma^* \}$

 #+NAME: Mapping Reducible
 #+BEGIN_EXPORT latex
 \begin{definition}[Computable Function]
   A function  $f : \Sigma^*  \longrightarrow \Sigma^*$ is  a \textbf{computable
   function} if  some Turing machine  $M$, on every  input $w$, halts  with just
   $f(w)$ on its tape.
 \end{definition}

 \begin{definition}[Mapping Reducible, Reduction]
   Language $A$ is \textbf{mapping reducible}  to language $B$, written $A \le_m
   B$,  if  there  is  a  computable  function  $f  :  \Sigma^*  \longrightarrow
   \Sigma^*$, where for every $w$, $$w \in A \iff f(w) \in B.$$ The function $f$
   is called the \textbf{reduction} from $A$ to $B$.
 \end{definition}
 #+END_EXPORT
