notes/notes.tex

\section{Chapter Four}
\label{sec:orgf72244e}
\subsection{Decidable}
\label{sec:orgd05dfc7}
\begin{itemize}
\item \(A_{DFA}=\{\langle B,w \rangle : B \text{ is a DFA that accepts input string }
   w\}\) is a \uline{decidable language}.
\begin{itemize}
\item \(M=\) "On input \(\lang B,w \rang\):
\begin{enumerate}
\item Simulate \(B\) on input \(w\).
\item If the simulation ends in an accept state, \emph{accept}. If it ends in a
nonaccepting state, \emph{reject}"
\end{enumerate}
\end{itemize}

\item \(A_{NFA}=\{\langle{}B,w\rangle : B \text{ is an NFA that accepts input
   string } w\}\) is a \uline{decidable language}.
\begin{itemize}
\item \(N=\) "On input \(\langle B,w \rangle\):
\begin{enumerate}
\item Convert NFA \(B\) to an equivalent DFA \(C\), using the procedure for this
conversion given in Theorem 1.39.
\item Run TM \(M\) from Theorem 4.1 on input \(\langle C,w \rangle\).
\item If \(M\) accepts, \emph{accept}; otherwise, \emph{reject}."
\end{enumerate}
\end{itemize}

\item \(A_{REX}=\{\langle{}R,w\rangle : R \text{ is a regular expression that
   generates string } w\}\) is a \uline{decidable language}.
\begin{itemize}
\item \(P=\) "On input \(\langle R,w \rangle\):
\begin{enumerate}
\item Convert regular expression \(R\) to an equivalent NFA \(A\) be using the
procedure for this conversion given in Theorem 1.54.
\item Run TM \(N\) on input \(\langle{}A,w\rangle\).
\item If \(N\) accepts, \emph{accept}; if \(N\) rejects, \emph{reject}."
\end{enumerate}
\end{itemize}

\item \(E_{DFA}=\{\langle A\rangle : A \text{ is a DFA and } L(A)=\varnothing\}\)
is a \uline{decidable language}.
\begin{itemize}
\item \(T=\) "On input \(\langle A \rangle\):
\begin{enumerate}
\item Mark the start state of \(A\).
\item Repeat until no new states get marked:
\begin{enumerate}
\item Mark any state that has a transition coming into it from any state that
is already marked.
\end{enumerate}
\item If no accept state is marked, \emph{accept}; otherwise, \emph{reject}."
\end{enumerate}
\end{itemize}

\item \(EQ_{DFA}=\{\langle A,B \rangle : A \text{ and } B \text{ are DFAs and }
   L(A)=L(B)\}\) is a \uline{decidable language}.
\begin{itemize}
\item This new DFA \(C\) accepts only those strings that are accepted by either \(A\)
or \(B\) but not by both. Thus, if \(A\) and \(B\) recognize the same language,
\(C\) will accept nothing.
$$L(C)=\left(L(A) \cap \overline{L(B)}\right) \cup
     \left(\overline{L(A)} \cap L(B)\right)$$
\item \(F=\) "On input \(\langle{}A,B\rangle\):
\begin{enumerate}
\item Construct DFA \(C\) as described.
\item Run TM \(T\) from Theorem 4.4 on input \(\langle{}C\rangle\).
\item If \(T\) accepts, \emph{accept}. If \(T\) rejects, \emph{reject}."
\end{enumerate}
\end{itemize}

\item \(A_{CFG}=\{\langle{}G,w\rangle : G \text{ is a CFG that generates string }
   w\}\) is a \uline{decidable language}.

\item \(E_{CFG}=\{\langle{}G\rangle : G \text{ is a CFG and } L(G)=\varnothing\}\)
is a \uline{decidable language}.
\end{itemize}

\subsection{Undecidable}
\label{sec:orgba64b64}
\begin{itemize}
\item \(A_{TM}=\{\langle{}M,w\rangle : M \text{ is a TM and } M \text{ accepts }
   w\}\) is an \uline{undecidable language}. It is also \uline{Turing-recognizable}. recognizers
\emph{are} more powerful than deciders. \(U\) recognizes \(A_{TM}\), it is the universal
Turing machine capable of simulating every other Turing machine. 
\begin{itemize}
\item \(U=\) "On input \(\langle{}M,w\rangle\):
\begin{enumerate}
\item Simulate \(M\) on input \(w\).
\item If \(M\) ever enters its accept state, \emph{accept}; if \(M\) ever enters its
reject state, \emph{rejects}."
\end{enumerate}
\item The proof of this relies on a technique called \emph{diagonalization}.
\end{itemize}

\item \(HALT_{TM}=\{\langle M,w \rangle : M \text{ is a TM and } M \text{ accepts } w\}\) is an
\uline{undecidable language}. It is also \uline{Turing-recognizable}. Let's assume for
the purpose of obtaining a contradiction that TM \(R\) decides /HALT/\(_{\text{TM}}\)
\begin{itemize}
\item \(U=\) "On input \(\langle M, w \rangle\), an encoding of a TM \(M\) and
a string \(w\):
\begin{enumerate}
\item Run TM \(R\) on input \(\langle M,w \rangle\).
\item If \(R\) rejects, \emph{reject}.
\item If \(R\) accepts, simulate \(M\) on \(w\) until it halts.
\item If \(M\) has accepted, \emph{accept}; if \(M\) has rejected, \emph{reject}."
\end{enumerate}
\item Clearly, if \(R\) decides HALT\(_{\text{TM}}\), then \(S\) decides A\(_{\text{TM}}\). Because A\(_{\text{TM}}\).
Because A\(_{\text{TM}}\) is undecidable, HALT\(_{\text{TM}}\) also must be undecidable.
\end{itemize}
\end{itemize}

\section{Chapter Five}
\label{sec:orgdedf500}
\subsection{Reducible}
\label{sec:org7620c09}
\begin{definition}[Computation History]
  Let $M$  be a Turing  Machine and $w$  an input string.  An \textbf{accepting
    computation history} for $M$ on $w$  is a sequence of configurations, $C_1,
    C_2, ..., C_l$, where $C_1$ is the start configuration of $M$ on $w$, $C_l$
    is  an  accepting configuration  of  $M$  on  $w$,  $C_l$ is  an  accepting
    configuration  of $M$,  and  each $C_i$  legally follows  from  $C_{i -  1}
    $according to  the rules of  $M$. A \textbf{rejecting  computation history}
    for  $M$ on  $w$ is  defined similarly,  except that  $C_l$ is  a rejecting
    configuration.

\end{definition}

\begin{definition}[Linear Bounded Automaton]
  A \textbf{linear  bounded automaton}  is a restricted  type of  Turing machine
  wherein the  tape head  isn't permitted to  move off the  portion of  the tape
  containing the input. If the machine tries  to move its head off either end of
  the input, the head stays where it is---in the same way that the head will not
  move off the left-hand end of an ordinary Turing machine's tape.
\end{definition}

\begin{lemma}
  Let $M$ be an LBA with $q$ states  and $g$ symbols in the tape alphabet. There
  are exactly $qng^n$  distinct configurations of $M$ for a  tape of length $n$.
  \end{lemma} 

\begin{itemize}
\item \(A_{LBA}\) is  \uline{decidable}. \(E_{LBA}\) is  \uline{undecidable}. \(E_{LBA} = \{  \langle M
   \rangle \mid M\) is an LBA and \(L(M) = \varnothing \}\)

\item ALL\(_{\text{CFG}}\) is \uline{undecidable}. \(ALL_{CFG} = \{ \langle G \rangle \mid G\) is a CFG
and \(L(G) = \Sigma^* \}\)
\end{itemize}

\begin{definition}[Computable Function]
  A function  $f : \Sigma^*  \longrightarrow \Sigma^*$ is  a \textbf{computable
  function} if  some Turing machine  $M$, on every  input $w$, halts  with just
  $f(w)$ on its tape.
\end{definition}

\begin{definition}[Mapping Reducible, Reduction]
  Language $A$ is \textbf{mapping reducible}  to language $B$, written $A \le_m
  B$,  if  there  is  a  computable  function  $f  :  \Sigma^*  \longrightarrow
  \Sigma^*$, where for every $w$, $$w \in A \iff f(w) \in B.$$ The function $f$
  is called the \textbf{reduction} from $A$ to $B$.
\end{definition}
\end{document}